#+TITLE:State of the art in code and test co-evolution
# #+SUBTITLE: Internship at KTH from May 13, 2019 to July 15, 2019
#+AUTHOR: Quentin \textsc{Le\ Dilavrec}
#+LaTeX_CLASS: sdm
#+LaTeX_CLASS_OPTIONS: [11pt]
#+OPTIONS: title:nil toc:nil
#+LANGUAGE: american
#+EMAIL:     (concat "quentin.le-dilavrec" at-sign "ens-rennes.fr")
#+SEQ_TODO: APPT(a) TODO(t) NEXT(n) STARTED(s) WAITING(w) HALF(h) APPT(a) | DONE(d) CANCELLED(c) DEFERRED(f)
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="org.css"/>
#+LATEX_HEADER: \usepackage{graphicx}
#+LATEX_HEADER: \usepackage{fullpage}
# #+LATEX_HEADER: \usepackage{wrapfig}
#+LATEX_HEADER: \usepackage{longtable}
#+LATEX_HEADER: \usepackage{makecell}
#+LATEX_HEADER: \usepackage{afterpage} %break page later
#+LATEX_HEADER: \usepackage{textcomp}
#+LATEX_HEADER: \usepackage{amssymb} %circulaarrow
#+LATEX_HEADER: \usepackage{dblfnote}
#+LATEX_HEADER: \DFNalwaysdouble
#+LATEX_HEADER: \usepackage{hyperref}
 
# numeroter les pages
#+LATEX_HEADER: \pagestyle{plain}
#+LATEX_HEADER: \usepackage{caption}
#+LATEX_HEADER: \usepackage{subcaption}
#+LATEX_HEADER: \usepackage{lscape}
#+LATEX_HEADER: \usepackage{titletoc}
#+LATEX_HEADER: \usepackage[utf8]{inputenc}
#+LATEX_HEADER: \usepackage[T1]{fontenc}
#+LATEX_HEADER: \usepackage{relsize}
#+LATEX_HEADER: \usepackage{tikz}
# #+LATEX_HEADER: \renewcommand\UrlFont{\color{blue}\rmfamily}
#+LATEX_HEADER: \usepackage[american]{babel}
#+LATEX_HEADER: \usepackage{minted}
#+LATEX_HEADER: \usepackage{mdframed}
# #+LATEX_HEADER: \usepackage{color}
#+LATEX_HEADER: \input{./featuretree.tex}
# #+LATEX_HEADER: \definecolor{lightgray}{gray}{0.9}
# #+LATEX_HEADER: \usepackage[a-1b]{pdfx}
# #+LATEX_HEADER: \usepackage{hyperref}
# #+LATEX_HEADER: \usepackage[normalem]{ulem}
# #+LATEX_HEADER: \tikzset{every picture/.style={line width=0.75pt}} %set default line width to 0.75pt        
# #+LATEX_HEADER: \institute{\inst{1} Affil1 \and \inst{2} Affil2 \and \inst{3} Affil3}
 # \inst{2} \and Author3 \inst{3}}
**** more   :noexport:
#+NAME: granularitytable1
#+begin_src python :exports results :hlines yes :colnames no :var val=2 :var data=interm
import pandas as pd
import numpy as np
import re
import bibtexparser

d = {}
with open('references.bib') as bibtex_file:
    bib_database = bibtexparser.load(bibtex_file)
    for x in bib_database.entries:
        d[x['ID']]=x

h = ['ref']
df = pd.DataFrame(data[2:],columns=data[0])
df = df[h].reindex(h, axis=1)
prog = re.compile(r"^(?:(.*?) )?cite:([^\s]*)(.*)$") # cite:(.*) (.*)")
def format_cite(x):
    r = prog.match(str(x))
    if r is None:
        return x
    else:
        tmp = '\cite{'+ r.group(2) + '}'
        if r.group(1) is not None:
            tmp = r.group(1) + tmp
        if r.group(3) is not None:
            tmp = tmp + r.group(3)
        return tmp
def access_bib(k):
    def f(x):
        r = prog.match(str(x))
        if r is None:
            return x
        else:
            return d[r.group(2)][k]
    return f

df['author'] = df['ref'].apply(access_bib('author'))
df['title'] = df['ref'].apply(access_bib('title'))
df = df.applymap(format_cite)

def format_row(x, i):
    tmp = list(x)
    for j in range(len(tmp)):
        tmp[j]=str(tmp[j]).replace('\n',' ')
    return tmp

r = list([format_row(x,i) for i,x in enumerate(df[['ref','title']].values)])

return(r)
#+end_src

#+RESULTS: granularitytable1
| \cite{wang2017behavioral}            | Behavioral Execution Comparison: Are Tests Representative of Field Behavior?                                                           |
| \cite{jin2012bugredux}               | BugRedux: reproducing field failures for in-house debugging                                                                            |
| \cite{alex2019bridging}              | Bridging the Gap between Unit Test Generation and System Test Generation                                                               |
| \cite{hindle2012naturalness}         | On the naturalness of software                                                                                                         |
| \cite{jiang2006multiresolution}      | Multiresolution Abnormal Trace Detection Using Varied-Length $ n $-Grams and Automata                                                  |
| \cite{beschastnikh2013unifying}      | Unifying FSM-inference algorithms through declarative specification                                                                    |
| \cite{tonella2014interpolated}       | Interpolated n-grams for model based testing                                                                                           |
| \cite{hebig2016approaches}           | Approaches to co-evolution of metamodels and models: A survey                                                                          |
| \cite{khelladi2018change}            | Change Propagation-based and Composition-based Co-evolution of Transformations with Evolving Metamodels                                |
| \cite{khelladi2017semi}              | A semi-automatic maintenance and co-evolution of OCL constraints with (meta) model evolution                                           |
| \cite{zaidman2008mining}             | Mining software repositories to study co-evolution of production \& test code                                                          |
| \cite{zaidman2011studying}           | Studying the co-evolution of production and test code in open source and industrial developer test processes through repository mining |
| \cite{levin2017co}                   | The co-evolution of test maintenance and code maintenance through the lens of fine-grained semantic changes                            |
| \cite{gall2009change}                | Change analysis with evolizer and changedistiller                                                                                      |
| \cite{martinez2019coming}            | Coming: a tool for mining change pattern instances from git commits                                                                    |
| \cite{levin2017boosting}             | Boosting automatic commit classification into maintenance activities by utilizing source code changes                                  |
| \cite{schafer2008mining}             | Mining framework usage changes from instantiation code                                                                                 |
| \cite{andreasen2017survey}           | A survey of dynamic analysis and test generation for JavaScript                                                                        |
| \cite{zhu1997software}               | Software unit test coverage and adequacy                                                                                               |
| \cite{mirshokraie2013efficient}      | Efficient JavaScript mutation testing                                                                                                  |
| \cite{gyimesi2019bugsjs}             | Bugsjs: A benchmark of javascript bugs                                                                                                 |
| \cite{richards2010analysis}          | An analysis of the dynamic behavior of JavaScript programs                                                                             |
| \cite{anand2013orchestrated}         | An orchestrated survey of methodologies for automated software test case generation                                                    |
| \cite{pinto2012understanding}        | Understanding myths and realities of test-suite evolution                                                                              |
| \cite{arcuri2011adaptive}            | Adaptive random testing: An illusion of effectiveness?                                                                                 |
| \cite{xu2010directed}                | Directed test suite augmentation: techniques and tradeoffs                                                                             |
| \cite{marsavina2014studying}         | Studying fine-grained co-evolution patterns of production and test code                                                                |
| \cite{mirzaaghaei2014automatic}      | Automatic test case evolution                                                                                                          |
| \cite{fraser2011evosuite}            | EvoSuite: automatic test suite generation for object-oriented software                                                                 |
| \cite{daniel2010test}                | On test repair using symbolic execution                                                                                                |
| \cite{arcuri2007coevolving}          | Coevolving programs and unit tests from their specification                                                                            |
| \cite{person2009differential}        | Differential symbolic execution                                                                                                        |
| \cite{hassan2009predicting}          | Predicting faults using the complexity of code changes                                                                                 |
| \cite{dagenais2011recommending}      | Recommending adaptive changes for framework evolution                                                                                  |
| \cite{halfond2008automated}          | Automated identification of parameter mismatches in web applications                                                                   |
| \cite{vcubranic2003hipikat}          | Hipikat: Recommending pertinent software development artifacts                                                                         |
| \cite{xing2006refactoring}           | Refactoring practice: How it is and how it should be supported-an eclipse case study                                                   |
| \cite{levin2016using}                | Using temporal and semantic developer-level information to predict maintenance activity profiles                                       |
| \cite{memon2008automatically}        | Automatically repairing event sequence-based GUI test suites for regression testing                                                    |
| \cite{thummalapenta2009mseqgen}      | MSeqGen: Object-oriented unit-test generation via mining source code                                                                   |
| \cite{robinson2011scaling}           | Scaling up automated test generation: Automatically generating maintainable regression unit tests for programs                         |
| \cite{tsantalis2018accurate}         | Accurate and efficient refactoring detection in commit history                                                                         |
| \cite{arcuri2008automation}          | On the automation of fixing software bugs                                                                                              |
| \cite{arcuri2008multi}               | Multi-objective improvement of software using co-evolution and smart seeding                                                           |
| \cite{arcuri2008novel}               | A novel co-evolutionary approach to automatic software bug fixing                                                                      |
| \cite{papadakis2019mutation}         | Mutation testing advances: an analysis and survey                                                                                      |
| \cite{jia2010analysis}               | An analysis and survey of the development of mutation testing                                                                          |
| \cite{adamopoulos2004overcome} *     | How to overcome the equivalent mutant problem and achieve tailored selective mutation using co-evolution                               |
| \cite{zhang2011automatic}            | Automatic generation of load tests                                                                                                     |
| \cite{nistor2015caramel}           ? | Caramel: Detecting and fixing performance problems that have non-intrusive fixes                                                       |
| \cite{beller2015how}                 | When, how, and why developers (do not) test in their IDEs                                                                              |
| \cite{freeman2002software}           | Software testing                                                                                                                       |
| \cite{hedin2014jsflow}               | JSFlow: Tracking information flow in JavaScript and its APIs                                                                           |
| \cite{dhondt2002coevolution}         | Co-evolution of object-oriented software design and implementation                                                                     |
| \cite{leotta2013capture}             | Capture-replay vs. programmable web testing: An empirical assessment during test case evolution                                        |

